<template>
  <div class="programs">
    <div class="programs__wrapper">
      <div class="programs__title">Наши программы</div>
    </div>
  </div>
</template>

<script>
export default {
  data() {
    return {
      programs: [
        {
          image: '1',
          title: 'Лучшая версия себя',
          text:
            'Программа "Создай свою лучшую версию" раскроет ваш внутренний потенциал, поможет найти свое предназначение. Вы почувствуете прилив энергии и, наконец-то, займетесь своим любимым делом!',
        },

        {
          image: '2',
          title: 'Стать счастливым',
          text:
            '"МЕЧТЫ-сбываются, желания-исполняются!"- не ваш девиз? После программы "Как стать счастливым" вашими ключевыми фразами станут : хочу жить, хочу любить, хочу мечтать! Эта "троица" наполнит осознанием своих истинных желаний, внутренней энергией, свободой и силой.',
        },

        {
          image: '3',
          title: 'Справиться с потерями в жизни',
          text:
            'Жизнь не доставляет вам удовольствия? Депрессия сдавливает горло? Программа "Как справиться с потерями в жизни" избавит вас навсегда от негативного опыта и переживаний, даст возможность задышать полной грудью.',
        },

        {
          image: '4',
          title: 'Выйти замуж за 90 дней',
          text:
            'Если вы мечтаете с радостью просыпаться на плече любимого, получать удовольствие от жизни вдвоем, пройдите нашу программу "Как выйти замуж за 90 дней" и вы услышите те самые заветные: "Я хочу пройти этот путь вместе с тобой..." от самого лучшего мужчины в вашей жизни.',
        },

        {
          image: '5',
          title: 'Прибыльный бизнес за 90 дней',
          text:
            '"А жизнь-то налаживается..." У вас не так? Программа "Как создать свой прибыльный бизнес" поможет продумать, подготовить и внедрить крутой бизнес-план(круче только яйца)!',
        },

        {
          image: '6',
          title: 'Преодоление кризисов',
          text:
            'Программа "Преодоление кризисов" расставит все точки над и в сфере отношений, здоровья, карьеры, денег, превратит проблемы в ресурсы , чтобы желание действовать, идти вперёд всегда сопровождало вас по жизни, как говорится "вижу цель-не вижу препятствий"',
        },
      ],
    }
  },
}
</script>

<style lang="scss" scoped>
@import 'sass-rem/_rem.scss';

.programs {
  width: 100%;
  padding: rem(146px 0 177px);

  &__wrapper {
    max-width: rem(1100px);
    width: 100%;
    margin: 0 auto;
  }

  &__title {
    font-family: Oswald;
    font-weight: bold;
    font-size: rem(48px);
    line-height: rem(71px);
    letter-spacing: rem(3.072px);
    color: #252525;
    position: relative;

    &::before {
      position: absolute;
      content: '';
      bottom: rem(-10px);
      left: 0;
      background: #252525;
      width: rem(45px);
      height: rem(2px);
    }
  }
}
</style>
